MikroElektronika/core_packages/PIC/XC8/def/PIC18F2685/mcu.h
extern volatile RXF9EIDHbits_t RXF9EIDHbits __at(0xD72);
// bitfield macros
#define _RXF9EIDH_EID8_POSN                                 0x0
#define _RXF9EIDH_EID8_POSITION                             0x0
#define _RXF9EIDH_EID8_SIZE                                 0x1
#define _RXF9EIDH_EID8_LENGTH                               0x1
#define _RXF9EIDH_EID8_MASK                                 0x1
#define _RXF9EIDH_EID9_POSN                                 0x1
#define _RXF9EIDH_EID9_POSITION                             0x1
#define _RXF9EIDH_EID9_SIZE                                 0x1
#define _RXF9EIDH_EID9_LENGTH                               0x1
#define _RXF9EIDH_EID9_MASK                                 0x2
#define _RXF9EIDH_EID10_POSN                                0x2
#define _RXF9EIDH_EID10_POSITION                            0x2
#define _RXF9EIDH_EID10_SIZE                                0x1
#define _RXF9EIDH_EID10_LENGTH                              0x1
#define _RXF9EIDH_EID10_MASK                                0x4
#define _RXF9EIDH_EID11_POSN                                0x3
#define _RXF9EIDH_EID11_POSITION                            0x3
#define _RXF9EIDH_EID11_SIZE                                0x1
#define _RXF9EIDH_EID11_LENGTH                              0x1
#define _RXF9EIDH_EID11_MASK                                0x8
#define _RXF9EIDH_EID12_POSN                                0x4
#define _RXF9EIDH_EID12_POSITION                            0x4
#define _RXF9EIDH_EID12_SIZE                                0x1
#define _RXF9EIDH_EID12_LENGTH                              0x1
#define _RXF9EIDH_EID12_MASK                                0x10
#define _RXF9EIDH_EID13_POSN                                0x5
#define _RXF9EIDH_EID13_POSITION                            0x5
#define _RXF9EIDH_EID13_SIZE                                0x1
#define _RXF9EIDH_EID13_LENGTH                              0x1
#define _RXF9EIDH_EID13_MASK                                0x20
#define _RXF9EIDH_EID14_POSN                                0x6
#define _RXF9EIDH_EID14_POSITION                            0x6
#define _RXF9EIDH_EID14_SIZE                                0x1
#define _RXF9EIDH_EID14_LENGTH                              0x1
#define _RXF9EIDH_EID14_MASK                                0x40
#define _RXF9EIDH_EID15_POSN                                0x7
#define _RXF9EIDH_EID15_POSITION                            0x7
#define _RXF9EIDH_EID15_SIZE                                0x1
#define _RXF9EIDH_EID15_LENGTH                              0x1
#define _RXF9EIDH_EID15_MASK                                0x80
#define _RXF9EIDH_RXF9EID8_POSN                             0x0
#define _RXF9EIDH_RXF9EID8_POSITION                         0x0
#define _RXF9EIDH_RXF9EID8_SIZE                             0x1
#define _RXF9EIDH_RXF9EID8_LENGTH                           0x1
#define _RXF9EIDH_RXF9EID8_MASK                             0x1
#define _RXF9EIDH_RXF9EID9_POSN                             0x1
#define _RXF9EIDH_RXF9EID9_POSITION                         0x1
#define _RXF9EIDH_RXF9EID9_SIZE                             0x1
#define _RXF9EIDH_RXF9EID9_LENGTH                           0x1
#define _RXF9EIDH_RXF9EID9_MASK                             0x2
#define _RXF9EIDH_RXF9EID10_POSN                            0x2
#define _RXF9EIDH_RXF9EID10_POSITION                        0x2
#define _RXF9EIDH_RXF9EID10_SIZE                            0x1
#define _RXF9EIDH_RXF9EID10_LENGTH                          0x1
#define _RXF9EIDH_RXF9EID10_MASK                            0x4
#define _RXF9EIDH_RXF9EID11_POSN                            0x3
#define _RXF9EIDH_RXF9EID11_POSITION                        0x3
#define _RXF9EIDH_RXF9EID11_SIZE                            0x1
#define _RXF9EIDH_RXF9EID11_LENGTH                          0x1
#define _RXF9EIDH_RXF9EID11_MASK                            0x8
#define _RXF9EIDH_RXF9EID12_POSN                            0x4
#define _RXF9EIDH_RXF9EID12_POSITION                        0x4
#define _RXF9EIDH_RXF9EID12_SIZE                            0x1
#define _RXF9EIDH_RXF9EID12_LENGTH                          0x1
#define _RXF9EIDH_RXF9EID12_MASK                            0x10
#define _RXF9EIDH_RXF9EID13_POSN                            0x5
#define _RXF9EIDH_RXF9EID13_POSITION                        0x5
#define _RXF9EIDH_RXF9EID13_SIZE                            0x1
#define _RXF9EIDH_RXF9EID13_LENGTH                          0x1
#define _RXF9EIDH_RXF9EID13_MASK                            0x20
#define _RXF9EIDH_RXF9EID14_POSN                            0x6
#define _RXF9EIDH_RXF9EID14_POSITION                        0x6
#define _RXF9EIDH_RXF9EID14_SIZE                            0x1
#define _RXF9EIDH_RXF9EID14_LENGTH                          0x1
#define _RXF9EIDH_RXF9EID14_MASK                            0x40
#define _RXF9EIDH_RXF9EID15_POSN                            0x7
#define _RXF9EIDH_RXF9EID15_POSITION                        0x7
#define _RXF9EIDH_RXF9EID15_SIZE                            0x1
#define _RXF9EIDH_RXF9EID15_LENGTH                          0x1
#define _RXF9EIDH_RXF9EID15_MASK                            0x80

// Register: RXF9EIDL
#define RXF9EIDL RXF9EIDL
extern volatile unsigned char           RXF9EIDL            __at(0xD73);
#ifndef _LIB_BUILD
asm("RXF9EIDL equ 0D73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF9EID0               :1;
        unsigned RXF9EID1               :1;
        unsigned RXF9EID2               :1;
        unsigned RXF9EID3               :1;
        unsigned RXF9EID4               :1;
        unsigned RXF9EID5               :1;
        unsigned RXF9EID6               :1;
        unsigned RXF9EID7               :1;
    };
} RXF9EIDLbits_t;
extern volatile RXF9EIDLbits_t RXF9EIDLbits __at(0xD73);
// bitfield macros
#define _RXF9EIDL_EID0_POSN                                 0x0
#define _RXF9EIDL_EID0_POSITION                             0x0
#define _RXF9EIDL_EID0_SIZE                                 0x1
#define _RXF9EIDL_EID0_LENGTH                               0x1
#define _RXF9EIDL_EID0_MASK                                 0x1
#define _RXF9EIDL_EID1_POSN                                 0x1
#define _RXF9EIDL_EID1_POSITION                             0x1
#define _RXF9EIDL_EID1_SIZE                                 0x1
#define _RXF9EIDL_EID1_LENGTH                               0x1
#define _RXF9EIDL_EID1_MASK                                 0x2
#define _RXF9EIDL_EID2_POSN                                 0x2
#define _RXF9EIDL_EID2_POSITION                             0x2
#define _RXF9EIDL_EID2_SIZE                                 0x1
#define _RXF9EIDL_EID2_LENGTH                               0x1
#define _RXF9EIDL_EID2_MASK                                 0x4
#define _RXF9EIDL_EID3_POSN                                 0x3
#define _RXF9EIDL_EID3_POSITION                             0x3
#define _RXF9EIDL_EID3_SIZE                                 0x1
#define _RXF9EIDL_EID3_LENGTH                               0x1
#define _RXF9EIDL_EID3_MASK                                 0x8
#define _RXF9EIDL_EID4_POSN                                 0x4
#define _RXF9EIDL_EID4_POSITION                             0x4
#define _RXF9EIDL_EID4_SIZE                                 0x1
#define _RXF9EIDL_EID4_LENGTH                               0x1
#define _RXF9EIDL_EID4_MASK                                 0x10
#define _RXF9EIDL_EID5_POSN                                 0x5
#define _RXF9EIDL_EID5_POSITION                             0x5
#define _RXF9EIDL_EID5_SIZE                                 0x1
#define _RXF9EIDL_EID5_LENGTH                               0x1
#define _RXF9EIDL_EID5_MASK                                 0x20
#define _RXF9EIDL_EID6_POSN                                 0x6
#define _RXF9EIDL_EID6_POSITION                             0x6
#define _RXF9EIDL_EID6_SIZE                                 0x1
#define _RXF9EIDL_EID6_LENGTH                               0x1
#define _RXF9EIDL_EID6_MASK                                 0x40
#define _RXF9EIDL_EID7_POSN                                 0x7
#define _RXF9EIDL_EID7_POSITION                             0x7
#define _RXF9EIDL_EID7_SIZE                                 0x1
#define _RXF9EIDL_EID7_LENGTH                               0x1
#define _RXF9EIDL_EID7_MASK                                 0x80
#define _RXF9EIDL_RXF9EID0_POSN                             0x0
#define _RXF9EIDL_RXF9EID0_POSITION                         0x0
#define _RXF9EIDL_RXF9EID0_SIZE                             0x1
#define _RXF9EIDL_RXF9EID0_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID0_MASK                             0x1
#define _RXF9EIDL_RXF9EID1_POSN                             0x1
#define _RXF9EIDL_RXF9EID1_POSITION                         0x1
#define _RXF9EIDL_RXF9EID1_SIZE                             0x1
#define _RXF9EIDL_RXF9EID1_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID1_MASK                             0x2
#define _RXF9EIDL_RXF9EID2_POSN                             0x2
#define _RXF9EIDL_RXF9EID2_POSITION                         0x2
#define _RXF9EIDL_RXF9EID2_SIZE                             0x1
#define _RXF9EIDL_RXF9EID2_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID2_MASK                             0x4
#define _RXF9EIDL_RXF9EID3_POSN                             0x3
#define _RXF9EIDL_RXF9EID3_POSITION                         0x3
#define _RXF9EIDL_RXF9EID3_SIZE                             0x1
#define _RXF9EIDL_RXF9EID3_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID3_MASK                             0x8
#define _RXF9EIDL_RXF9EID4_POSN                             0x4
#define _RXF9EIDL_RXF9EID4_POSITION                         0x4
#define _RXF9EIDL_RXF9EID4_SIZE                             0x1
#define _RXF9EIDL_RXF9EID4_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID4_MASK                             0x10
#define _RXF9EIDL_RXF9EID5_POSN                             0x5
#define _RXF9EIDL_RXF9EID5_POSITION                         0x5
#define _RXF9EIDL_RXF9EID5_SIZE                             0x1
#define _RXF9EIDL_RXF9EID5_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID5_MASK                             0x20
#define _RXF9EIDL_RXF9EID6_POSN                             0x6
#define _RXF9EIDL_RXF9EID6_POSITION                         0x6
#define _RXF9EIDL_RXF9EID6_SIZE                             0x1
#define _RXF9EIDL_RXF9EID6_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID6_MASK                             0x40
#define _RXF9EIDL_RXF9EID7_POSN                             0x7
#define _RXF9EIDL_RXF9EID7_POSITION                         0x7
#define _RXF9EIDL_RXF9EID7_SIZE                             0x1
#define _RXF9EIDL_RXF9EID7_LENGTH                           0x1
#define _RXF9EIDL_RXF9EID7_MASK                             0x80

// Register: RXF10SIDH
#define RXF10SIDH RXF10SIDH
extern volatile unsigned char           RXF10SIDH           __at(0xD74);
#ifndef _LIB_BUILD
asm("RXF10SIDH equ 0D74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF10SID3              :1;
        unsigned RXF10SID4              :1;
        unsigned RXF10SID5              :1;
        unsigned RXF10SID6              :1;
        unsigned RXF10SID7              :1;
        unsigned RXF10SID8              :1;
        unsigned RXF10SID9              :1;
        unsigned RXF10SID10             :1;
    };
} RXF10SIDHbits_t;
