MikroElektronika/core_packages/PIC/XC8/def/PIC18F2685/mcu.h
// Register: RXF13SIDL
#define RXF13SIDL RXF13SIDL
extern volatile unsigned char           RXF13SIDL           __at(0xD85);
#ifndef _LIB_BUILD
asm("RXF13SIDL equ 0D85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF13EID16             :1;
        unsigned RXF13EID17             :1;
        unsigned                        :1;
        unsigned RXF13EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF13SID0              :1;
        unsigned RXF13SID1              :1;
        unsigned RXF13SID2              :1;
    };
} RXF13SIDLbits_t;
extern volatile RXF13SIDLbits_t RXF13SIDLbits __at(0xD85);
// bitfield macros
#define _RXF13SIDL_EID16_POSN                               0x0
#define _RXF13SIDL_EID16_POSITION                           0x0
#define _RXF13SIDL_EID16_SIZE                               0x1
#define _RXF13SIDL_EID16_LENGTH                             0x1
#define _RXF13SIDL_EID16_MASK                               0x1
#define _RXF13SIDL_EID17_POSN                               0x1
#define _RXF13SIDL_EID17_POSITION                           0x1
#define _RXF13SIDL_EID17_SIZE                               0x1
#define _RXF13SIDL_EID17_LENGTH                             0x1
#define _RXF13SIDL_EID17_MASK                               0x2
#define _RXF13SIDL_EXIDEN_POSN                              0x3
#define _RXF13SIDL_EXIDEN_POSITION                          0x3
#define _RXF13SIDL_EXIDEN_SIZE                              0x1
#define _RXF13SIDL_EXIDEN_LENGTH                            0x1
#define _RXF13SIDL_EXIDEN_MASK                              0x8
#define _RXF13SIDL_SID0_POSN                                0x5
#define _RXF13SIDL_SID0_POSITION                            0x5
#define _RXF13SIDL_SID0_SIZE                                0x1
#define _RXF13SIDL_SID0_LENGTH                              0x1
#define _RXF13SIDL_SID0_MASK                                0x20
#define _RXF13SIDL_SID1_POSN                                0x6
#define _RXF13SIDL_SID1_POSITION                            0x6
#define _RXF13SIDL_SID1_SIZE                                0x1
#define _RXF13SIDL_SID1_LENGTH                              0x1
#define _RXF13SIDL_SID1_MASK                                0x40
#define _RXF13SIDL_SID2_POSN                                0x7
#define _RXF13SIDL_SID2_POSITION                            0x7
#define _RXF13SIDL_SID2_SIZE                                0x1
#define _RXF13SIDL_SID2_LENGTH                              0x1
#define _RXF13SIDL_SID2_MASK                                0x80
#define _RXF13SIDL_EXIDE_POSN                               0x3
#define _RXF13SIDL_EXIDE_POSITION                           0x3
#define _RXF13SIDL_EXIDE_SIZE                               0x1
#define _RXF13SIDL_EXIDE_LENGTH                             0x1
#define _RXF13SIDL_EXIDE_MASK                               0x8
#define _RXF13SIDL_RXF13EID16_POSN                          0x0
#define _RXF13SIDL_RXF13EID16_POSITION                      0x0
#define _RXF13SIDL_RXF13EID16_SIZE                          0x1
#define _RXF13SIDL_RXF13EID16_LENGTH                        0x1
#define _RXF13SIDL_RXF13EID16_MASK                          0x1
#define _RXF13SIDL_RXF13EID17_POSN                          0x1
#define _RXF13SIDL_RXF13EID17_POSITION                      0x1
#define _RXF13SIDL_RXF13EID17_SIZE                          0x1
#define _RXF13SIDL_RXF13EID17_LENGTH                        0x1
#define _RXF13SIDL_RXF13EID17_MASK                          0x2
#define _RXF13SIDL_RXF13EXIDEN_POSN                         0x3
#define _RXF13SIDL_RXF13EXIDEN_POSITION                     0x3
#define _RXF13SIDL_RXF13EXIDEN_SIZE                         0x1
#define _RXF13SIDL_RXF13EXIDEN_LENGTH                       0x1
#define _RXF13SIDL_RXF13EXIDEN_MASK                         0x8
#define _RXF13SIDL_RXF13SID0_POSN                           0x5
#define _RXF13SIDL_RXF13SID0_POSITION                       0x5
#define _RXF13SIDL_RXF13SID0_SIZE                           0x1
#define _RXF13SIDL_RXF13SID0_LENGTH                         0x1
#define _RXF13SIDL_RXF13SID0_MASK                           0x20
#define _RXF13SIDL_RXF13SID1_POSN                           0x6
#define _RXF13SIDL_RXF13SID1_POSITION                       0x6
#define _RXF13SIDL_RXF13SID1_SIZE                           0x1
#define _RXF13SIDL_RXF13SID1_LENGTH                         0x1
#define _RXF13SIDL_RXF13SID1_MASK                           0x40
#define _RXF13SIDL_RXF13SID2_POSN                           0x7
#define _RXF13SIDL_RXF13SID2_POSITION                       0x7
#define _RXF13SIDL_RXF13SID2_SIZE                           0x1
#define _RXF13SIDL_RXF13SID2_LENGTH                         0x1
#define _RXF13SIDL_RXF13SID2_MASK                           0x80

// Register: RXF13EIDH
#define RXF13EIDH RXF13EIDH
extern volatile unsigned char           RXF13EIDH           __at(0xD86);
#ifndef _LIB_BUILD
asm("RXF13EIDH equ 0D86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF13EID8              :1;
        unsigned RXF13EID9              :1;
        unsigned RXF13EID10             :1;
        unsigned RXF13EID11             :1;
        unsigned RXF13EID12             :1;
        unsigned RXF13EID13             :1;
        unsigned RXF13EID14             :1;
        unsigned RXF13EID15             :1;
    };
} RXF13EIDHbits_t;
