MikroElektronika/core_packages/PIC/XC8/def/PIC18F2685/mcu.h
// Register: RXFBCON3
#define RXFBCON3 RXFBCON3
extern volatile unsigned char           RXFBCON3            __at(0xDE3);
#ifndef _LIB_BUILD
asm("RXFBCON3 equ 0DE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F6BP_0                 :1;
        unsigned F6BP_1                 :1;
        unsigned F6BP_2                 :1;
        unsigned F6BP_3                 :1;
        unsigned F7BP_0                 :1;
        unsigned F7BP_1                 :1;
        unsigned F7BP_2                 :1;
        unsigned F7BP_3                 :1;
    };
    struct {
        unsigned F6BP_01                :1;
    };
} RXFBCON3bits_t;
extern volatile RXFBCON3bits_t RXFBCON3bits __at(0xDE3);
// bitfield macros
#define _RXFBCON3_F6BP_0_POSN                               0x0
#define _RXFBCON3_F6BP_0_POSITION                           0x0
#define _RXFBCON3_F6BP_0_SIZE                               0x1
#define _RXFBCON3_F6BP_0_LENGTH                             0x1
#define _RXFBCON3_F6BP_0_MASK                               0x1
#define _RXFBCON3_F6BP_1_POSN                               0x1
#define _RXFBCON3_F6BP_1_POSITION                           0x1
#define _RXFBCON3_F6BP_1_SIZE                               0x1
#define _RXFBCON3_F6BP_1_LENGTH                             0x1
#define _RXFBCON3_F6BP_1_MASK                               0x2
#define _RXFBCON3_F6BP_2_POSN                               0x2
#define _RXFBCON3_F6BP_2_POSITION                           0x2
#define _RXFBCON3_F6BP_2_SIZE                               0x1
#define _RXFBCON3_F6BP_2_LENGTH                             0x1
#define _RXFBCON3_F6BP_2_MASK                               0x4
#define _RXFBCON3_F6BP_3_POSN                               0x3
#define _RXFBCON3_F6BP_3_POSITION                           0x3
#define _RXFBCON3_F6BP_3_SIZE                               0x1
#define _RXFBCON3_F6BP_3_LENGTH                             0x1
#define _RXFBCON3_F6BP_3_MASK                               0x8
#define _RXFBCON3_F7BP_0_POSN                               0x4
#define _RXFBCON3_F7BP_0_POSITION                           0x4
#define _RXFBCON3_F7BP_0_SIZE                               0x1
#define _RXFBCON3_F7BP_0_LENGTH                             0x1
#define _RXFBCON3_F7BP_0_MASK                               0x10
#define _RXFBCON3_F7BP_1_POSN                               0x5
#define _RXFBCON3_F7BP_1_POSITION                           0x5
#define _RXFBCON3_F7BP_1_SIZE                               0x1
#define _RXFBCON3_F7BP_1_LENGTH                             0x1
#define _RXFBCON3_F7BP_1_MASK                               0x20
#define _RXFBCON3_F7BP_2_POSN                               0x6
#define _RXFBCON3_F7BP_2_POSITION                           0x6
#define _RXFBCON3_F7BP_2_SIZE                               0x1
#define _RXFBCON3_F7BP_2_LENGTH                             0x1
#define _RXFBCON3_F7BP_2_MASK                               0x40
#define _RXFBCON3_F7BP_3_POSN                               0x7
#define _RXFBCON3_F7BP_3_POSITION                           0x7
#define _RXFBCON3_F7BP_3_SIZE                               0x1
#define _RXFBCON3_F7BP_3_LENGTH                             0x1
#define _RXFBCON3_F7BP_3_MASK                               0x80
#define _RXFBCON3_F6BP_01_POSN                              0x0
#define _RXFBCON3_F6BP_01_POSITION                          0x0
#define _RXFBCON3_F6BP_01_SIZE                              0x1
#define _RXFBCON3_F6BP_01_LENGTH                            0x1
#define _RXFBCON3_F6BP_01_MASK                              0x1

// Register: RXFBCON4
#define RXFBCON4 RXFBCON4
extern volatile unsigned char           RXFBCON4            __at(0xDE4);
#ifndef _LIB_BUILD
asm("RXFBCON4 equ 0DE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F8BP_0                 :1;
        unsigned F8BP_1                 :1;
        unsigned F8BP_2                 :1;
        unsigned F8BP_3                 :1;
        unsigned F9BP_0                 :1;
        unsigned F9BP_1                 :1;
        unsigned F9BP_2                 :1;
        unsigned F9BP_3                 :1;
    };
    struct {
        unsigned F8BP_01                :1;
    };
} RXFBCON4bits_t;
extern volatile RXFBCON4bits_t RXFBCON4bits __at(0xDE4);
// bitfield macros
#define _RXFBCON4_F8BP_0_POSN                               0x0
#define _RXFBCON4_F8BP_0_POSITION                           0x0
#define _RXFBCON4_F8BP_0_SIZE                               0x1
#define _RXFBCON4_F8BP_0_LENGTH                             0x1
#define _RXFBCON4_F8BP_0_MASK                               0x1
#define _RXFBCON4_F8BP_1_POSN                               0x1
#define _RXFBCON4_F8BP_1_POSITION                           0x1
#define _RXFBCON4_F8BP_1_SIZE                               0x1
#define _RXFBCON4_F8BP_1_LENGTH                             0x1
#define _RXFBCON4_F8BP_1_MASK                               0x2
#define _RXFBCON4_F8BP_2_POSN                               0x2
#define _RXFBCON4_F8BP_2_POSITION                           0x2
#define _RXFBCON4_F8BP_2_SIZE                               0x1
#define _RXFBCON4_F8BP_2_LENGTH                             0x1
#define _RXFBCON4_F8BP_2_MASK                               0x4
#define _RXFBCON4_F8BP_3_POSN                               0x3
#define _RXFBCON4_F8BP_3_POSITION                           0x3
#define _RXFBCON4_F8BP_3_SIZE                               0x1
#define _RXFBCON4_F8BP_3_LENGTH                             0x1
#define _RXFBCON4_F8BP_3_MASK                               0x8
#define _RXFBCON4_F9BP_0_POSN                               0x4
#define _RXFBCON4_F9BP_0_POSITION                           0x4
#define _RXFBCON4_F9BP_0_SIZE                               0x1
#define _RXFBCON4_F9BP_0_LENGTH                             0x1
#define _RXFBCON4_F9BP_0_MASK                               0x10
#define _RXFBCON4_F9BP_1_POSN                               0x5
#define _RXFBCON4_F9BP_1_POSITION                           0x5
#define _RXFBCON4_F9BP_1_SIZE                               0x1
#define _RXFBCON4_F9BP_1_LENGTH                             0x1
#define _RXFBCON4_F9BP_1_MASK                               0x20
#define _RXFBCON4_F9BP_2_POSN                               0x6
#define _RXFBCON4_F9BP_2_POSITION                           0x6
#define _RXFBCON4_F9BP_2_SIZE                               0x1
#define _RXFBCON4_F9BP_2_LENGTH                             0x1
#define _RXFBCON4_F9BP_2_MASK                               0x40
#define _RXFBCON4_F9BP_3_POSN                               0x7
#define _RXFBCON4_F9BP_3_POSITION                           0x7
#define _RXFBCON4_F9BP_3_SIZE                               0x1
#define _RXFBCON4_F9BP_3_LENGTH                             0x1
#define _RXFBCON4_F9BP_3_MASK                               0x80
#define _RXFBCON4_F8BP_01_POSN                              0x0
#define _RXFBCON4_F8BP_01_POSITION                          0x0
#define _RXFBCON4_F8BP_01_SIZE                              0x1
#define _RXFBCON4_F8BP_01_LENGTH                            0x1
#define _RXFBCON4_F8BP_01_MASK                              0x1

// Register: RXFBCON5
#define RXFBCON5 RXFBCON5
extern volatile unsigned char           RXFBCON5            __at(0xDE5);
#ifndef _LIB_BUILD
asm("RXFBCON5 equ 0DE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F10BP_0                :1;
        unsigned F10BP_1                :1;
        unsigned F10BP_2                :1;
        unsigned F10BP_3                :1;
        unsigned F11BP_0                :1;
        unsigned F11BP_1                :1;
        unsigned F11BP_2                :1;
        unsigned F11BP_3                :1;
    };
    struct {
        unsigned F10BP_01               :1;
    };
} RXFBCON5bits_t;
extern volatile RXFBCON5bits_t RXFBCON5bits __at(0xDE5);
// bitfield macros
#define _RXFBCON5_F10BP_0_POSN                              0x0
#define _RXFBCON5_F10BP_0_POSITION                          0x0
#define _RXFBCON5_F10BP_0_SIZE                              0x1
#define _RXFBCON5_F10BP_0_LENGTH                            0x1
#define _RXFBCON5_F10BP_0_MASK                              0x1
#define _RXFBCON5_F10BP_1_POSN                              0x1
#define _RXFBCON5_F10BP_1_POSITION                          0x1
#define _RXFBCON5_F10BP_1_SIZE                              0x1
#define _RXFBCON5_F10BP_1_LENGTH                            0x1
#define _RXFBCON5_F10BP_1_MASK                              0x2
#define _RXFBCON5_F10BP_2_POSN                              0x2
#define _RXFBCON5_F10BP_2_POSITION                          0x2
#define _RXFBCON5_F10BP_2_SIZE                              0x1
#define _RXFBCON5_F10BP_2_LENGTH                            0x1
#define _RXFBCON5_F10BP_2_MASK                              0x4
#define _RXFBCON5_F10BP_3_POSN                              0x3
#define _RXFBCON5_F10BP_3_POSITION                          0x3
#define _RXFBCON5_F10BP_3_SIZE                              0x1
#define _RXFBCON5_F10BP_3_LENGTH                            0x1
#define _RXFBCON5_F10BP_3_MASK                              0x8
#define _RXFBCON5_F11BP_0_POSN                              0x4
#define _RXFBCON5_F11BP_0_POSITION                          0x4
#define _RXFBCON5_F11BP_0_SIZE                              0x1
#define _RXFBCON5_F11BP_0_LENGTH                            0x1
#define _RXFBCON5_F11BP_0_MASK                              0x10
#define _RXFBCON5_F11BP_1_POSN                              0x5
#define _RXFBCON5_F11BP_1_POSITION                          0x5
#define _RXFBCON5_F11BP_1_SIZE                              0x1
#define _RXFBCON5_F11BP_1_LENGTH                            0x1
#define _RXFBCON5_F11BP_1_MASK                              0x20
#define _RXFBCON5_F11BP_2_POSN                              0x6
#define _RXFBCON5_F11BP_2_POSITION                          0x6
#define _RXFBCON5_F11BP_2_SIZE                              0x1
#define _RXFBCON5_F11BP_2_LENGTH                            0x1
#define _RXFBCON5_F11BP_2_MASK                              0x40
#define _RXFBCON5_F11BP_3_POSN                              0x7
#define _RXFBCON5_F11BP_3_POSITION                          0x7
#define _RXFBCON5_F11BP_3_SIZE                              0x1
#define _RXFBCON5_F11BP_3_LENGTH                            0x1
#define _RXFBCON5_F11BP_3_MASK                              0x80
#define _RXFBCON5_F10BP_01_POSN                             0x0
#define _RXFBCON5_F10BP_01_POSITION                         0x0
#define _RXFBCON5_F10BP_01_SIZE                             0x1
#define _RXFBCON5_F10BP_01_LENGTH                           0x1
#define _RXFBCON5_F10BP_01_MASK                             0x1

// Register: RXFBCON6
#define RXFBCON6 RXFBCON6
extern volatile unsigned char           RXFBCON6            __at(0xDE6);
#ifndef _LIB_BUILD
asm("RXFBCON6 equ 0DE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F12BP_0                :1;
        unsigned F12BP_1                :1;
        unsigned F12BP_2                :1;
        unsigned F12BP_3                :1;
        unsigned F13BP_0                :1;
        unsigned F13BP_1                :1;
        unsigned F13BP_2                :1;
        unsigned F13BP_3                :1;
    };
    struct {
        unsigned F12BP_01               :1;
    };
} RXFBCON6bits_t;
