MikroElektronika/core_packages/PIC/XC8/def/PIC18F2685/mcu.h
extern volatile __bit                   B0RTREN             __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 B0RTREN_bit         _BIT_ACCESS(B0CON,2)
// B0CON<B0RTRRO>
extern volatile __bit                   B0RTRRO             __at(0x7105);	// @ (0xE20 * 8 + 5)
#define                                 B0RTRRO_bit         _BIT_ACCESS(B0CON,5)
// B0CON<B0RXFUL>
extern volatile __bit                   B0RXFUL             __at(0x7107);	// @ (0xE20 * 8 + 7)
#define                                 B0RXFUL_bit         _BIT_ACCESS(B0CON,7)
// B0CON<B0RXM1>
extern volatile __bit                   B0RXM1              __at(0x7106);	// @ (0xE20 * 8 + 6)
#define                                 B0RXM1_bit          _BIT_ACCESS(B0CON,6)
// B0DLC<B0RXRTR>
extern volatile __bit                   B0RXRTR             __at(0x712E);	// @ (0xE25 * 8 + 6)
#define                                 B0RXRTR_bit         _BIT_ACCESS(B0DLC,6)
// B0SIDL<B0SID0>
extern volatile __bit                   B0SID0              __at(0x7115);	// @ (0xE22 * 8 + 5)
#define                                 B0SID0_bit          _BIT_ACCESS(B0SIDL,5)
// B0SIDL<B0SID1>
extern volatile __bit                   B0SID1              __at(0x7116);	// @ (0xE22 * 8 + 6)
#define                                 B0SID1_bit          _BIT_ACCESS(B0SIDL,6)
// B0SIDH<B0SID10>
extern volatile __bit                   B0SID10             __at(0x710F);	// @ (0xE21 * 8 + 7)
#define                                 B0SID10_bit         _BIT_ACCESS(B0SIDH,7)
// B0SIDL<B0SID2>
extern volatile __bit                   B0SID2              __at(0x7117);	// @ (0xE22 * 8 + 7)
#define                                 B0SID2_bit          _BIT_ACCESS(B0SIDL,7)
// B0SIDH<B0SID3>
extern volatile __bit                   B0SID3              __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 B0SID3_bit          _BIT_ACCESS(B0SIDH,0)
// B0SIDH<B0SID4>
extern volatile __bit                   B0SID4              __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 B0SID4_bit          _BIT_ACCESS(B0SIDH,1)
// B0SIDH<B0SID5>
extern volatile __bit                   B0SID5              __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 B0SID5_bit          _BIT_ACCESS(B0SIDH,2)
// B0SIDH<B0SID6>
extern volatile __bit                   B0SID6              __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 B0SID6_bit          _BIT_ACCESS(B0SIDH,3)
// B0SIDH<B0SID7>
extern volatile __bit                   B0SID7              __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 B0SID7_bit          _BIT_ACCESS(B0SIDH,4)
// B0SIDH<B0SID8>
extern volatile __bit                   B0SID8              __at(0x710D);	// @ (0xE21 * 8 + 5)
#define                                 B0SID8_bit          _BIT_ACCESS(B0SIDH,5)
// B0SIDH<B0SID9>
extern volatile __bit                   B0SID9              __at(0x710E);	// @ (0xE21 * 8 + 6)
#define                                 B0SID9_bit          _BIT_ACCESS(B0SIDH,6)
// B0SIDL<B0SRR>
extern volatile __bit                   B0SRR               __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 B0SRR_bit           _BIT_ACCESS(B0SIDL,4)
// B0CON<B0TXABT>
extern volatile __bit                   B0TXABT             __at(0x7106);	// @ (0xE20 * 8 + 6)
#define                                 B0TXABT_bit         _BIT_ACCESS(B0CON,6)
// B0CON<B0TXB3IF>
extern volatile __bit                   B0TXB3IF            __at(0x7107);	// @ (0xE20 * 8 + 7)
#define                                 B0TXB3IF_bit        _BIT_ACCESS(B0CON,7)
// BSEL0<B0TXEN>
extern volatile __bit                   B0TXEN              __at(0x6FC2);	// @ (0xDF8 * 8 + 2)
#define                                 B0TXEN_bit          _BIT_ACCESS(BSEL0,2)
// B0CON<B0TXERR>
extern volatile __bit                   B0TXERR             __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 B0TXERR_bit         _BIT_ACCESS(B0CON,4)
// B0CON<B0TXLARB>
extern volatile __bit                   B0TXLARB            __at(0x7105);	// @ (0xE20 * 8 + 5)
#define                                 B0TXLARB_bit        _BIT_ACCESS(B0CON,5)
// B0CON<B0TXPRI0>
extern volatile __bit                   B0TXPRI0            __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 B0TXPRI0_bit        _BIT_ACCESS(B0CON,0)
// B0CON<B0TXPRI1>
extern volatile __bit                   B0TXPRI1            __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 B0TXPRI1_bit        _BIT_ACCESS(B0CON,1)
// B0CON<B0TXREQ>
extern volatile __bit                   B0TXREQ             __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 B0TXREQ_bit         _BIT_ACCESS(B0CON,3)
// B1D0<B1D00>
extern volatile __bit                   B1D00               __at(0x71B0);	// @ (0xE36 * 8 + 0)
#define                                 B1D00_bit           _BIT_ACCESS(B1D0,0)
// B1D0<B1D01>
extern volatile __bit                   B1D01               __at(0x71B1);	// @ (0xE36 * 8 + 1)
#define                                 B1D01_bit           _BIT_ACCESS(B1D0,1)
// B1D0<B1D02>
extern volatile __bit                   B1D02               __at(0x71B2);	// @ (0xE36 * 8 + 2)
#define                                 B1D02_bit           _BIT_ACCESS(B1D0,2)
// B1D0<B1D03>
extern volatile __bit                   B1D03               __at(0x71B3);	// @ (0xE36 * 8 + 3)
#define                                 B1D03_bit           _BIT_ACCESS(B1D0,3)
// B1D0<B1D04>
extern volatile __bit                   B1D04               __at(0x71B4);	// @ (0xE36 * 8 + 4)
#define                                 B1D04_bit           _BIT_ACCESS(B1D0,4)
// B1D0<B1D05>
extern volatile __bit                   B1D05               __at(0x71B5);	// @ (0xE36 * 8 + 5)
#define                                 B1D05_bit           _BIT_ACCESS(B1D0,5)
// B1D0<B1D06>
extern volatile __bit                   B1D06               __at(0x71B6);	// @ (0xE36 * 8 + 6)
#define                                 B1D06_bit           _BIT_ACCESS(B1D0,6)
// B1D0<B1D07>
extern volatile __bit                   B1D07               __at(0x71B7);	// @ (0xE36 * 8 + 7)
#define                                 B1D07_bit           _BIT_ACCESS(B1D0,7)
// B1D1<B1D10>
extern volatile __bit                   B1D10               __at(0x71B8);	// @ (0xE37 * 8 + 0)
#define                                 B1D10_bit           _BIT_ACCESS(B1D1,0)
// B1D1<B1D11>
extern volatile __bit                   B1D11               __at(0x71B9);	// @ (0xE37 * 8 + 1)
#define                                 B1D11_bit           _BIT_ACCESS(B1D1,1)
// B1D1<B1D12>
extern volatile __bit                   B1D12               __at(0x71BA);	// @ (0xE37 * 8 + 2)
#define                                 B1D12_bit           _BIT_ACCESS(B1D1,2)
// B1D1<B1D13>
extern volatile __bit                   B1D13               __at(0x71BB);	// @ (0xE37 * 8 + 3)
#define                                 B1D13_bit           _BIT_ACCESS(B1D1,3)
// B1D1<B1D14>
extern volatile __bit                   B1D14               __at(0x71BC);	// @ (0xE37 * 8 + 4)
#define                                 B1D14_bit           _BIT_ACCESS(B1D1,4)
// B1D1<B1D15>
extern volatile __bit                   B1D15               __at(0x71BD);	// @ (0xE37 * 8 + 5)
#define                                 B1D15_bit           _BIT_ACCESS(B1D1,5)
// B1D1<B1D16>
extern volatile __bit                   B1D16               __at(0x71BE);	// @ (0xE37 * 8 + 6)
#define                                 B1D16_bit           _BIT_ACCESS(B1D1,6)
// B1D1<B1D17>
extern volatile __bit                   B1D17               __at(0x71BF);	// @ (0xE37 * 8 + 7)
#define                                 B1D17_bit           _BIT_ACCESS(B1D1,7)
// B1D2<B1D20>
extern volatile __bit                   B1D20               __at(0x71C0);	// @ (0xE38 * 8 + 0)
#define                                 B1D20_bit           _BIT_ACCESS(B1D2,0)
// B1D2<B1D21>
extern volatile __bit                   B1D21               __at(0x71C1);	// @ (0xE38 * 8 + 1)
#define                                 B1D21_bit           _BIT_ACCESS(B1D2,1)
// B1D2<B1D22>
extern volatile __bit                   B1D22               __at(0x71C2);	// @ (0xE38 * 8 + 2)
#define                                 B1D22_bit           _BIT_ACCESS(B1D2,2)
// B1D2<B1D23>
extern volatile __bit                   B1D23               __at(0x71C3);	// @ (0xE38 * 8 + 3)
#define                                 B1D23_bit           _BIT_ACCESS(B1D2,3)
// B1D2<B1D24>
extern volatile __bit                   B1D24               __at(0x71C4);	// @ (0xE38 * 8 + 4)
#define                                 B1D24_bit           _BIT_ACCESS(B1D2,4)
// B1D2<B1D25>
extern volatile __bit                   B1D25               __at(0x71C5);	// @ (0xE38 * 8 + 5)
#define                                 B1D25_bit           _BIT_ACCESS(B1D2,5)
// B1D2<B1D26>
extern volatile __bit                   B1D26               __at(0x71C6);	// @ (0xE38 * 8 + 6)
#define                                 B1D26_bit           _BIT_ACCESS(B1D2,6)
// B1D2<B1D27>
extern volatile __bit                   B1D27               __at(0x71C7);	// @ (0xE38 * 8 + 7)
#define                                 B1D27_bit           _BIT_ACCESS(B1D2,7)
// B1D3<B1D30>
extern volatile __bit                   B1D30               __at(0x71C8);	// @ (0xE39 * 8 + 0)
#define                                 B1D30_bit           _BIT_ACCESS(B1D3,0)
// B1D3<B1D31>
extern volatile __bit                   B1D31               __at(0x71C9);	// @ (0xE39 * 8 + 1)
#define                                 B1D31_bit           _BIT_ACCESS(B1D3,1)
// B1D3<B1D32>
extern volatile __bit                   B1D32               __at(0x71CA);	// @ (0xE39 * 8 + 2)
#define                                 B1D32_bit           _BIT_ACCESS(B1D3,2)
// B1D3<B1D33>
extern volatile __bit                   B1D33               __at(0x71CB);	// @ (0xE39 * 8 + 3)
#define                                 B1D33_bit           _BIT_ACCESS(B1D3,3)
// B1D3<B1D34>
extern volatile __bit                   B1D34               __at(0x71CC);	// @ (0xE39 * 8 + 4)
#define                                 B1D34_bit           _BIT_ACCESS(B1D3,4)
// B1D3<B1D35>
extern volatile __bit                   B1D35               __at(0x71CD);	// @ (0xE39 * 8 + 5)
#define                                 B1D35_bit           _BIT_ACCESS(B1D3,5)
// B1D3<B1D36>
extern volatile __bit                   B1D36               __at(0x71CE);	// @ (0xE39 * 8 + 6)
#define                                 B1D36_bit           _BIT_ACCESS(B1D3,6)
// B1D3<B1D37>
extern volatile __bit                   B1D37               __at(0x71CF);	// @ (0xE39 * 8 + 7)
#define                                 B1D37_bit           _BIT_ACCESS(B1D3,7)
// B1D4<B1D40>
extern volatile __bit                   B1D40               __at(0x71D0);	// @ (0xE3A * 8 + 0)
#define                                 B1D40_bit           _BIT_ACCESS(B1D4,0)
// B1D4<B1D41>
extern volatile __bit                   B1D41               __at(0x71D1);	// @ (0xE3A * 8 + 1)
#define                                 B1D41_bit           _BIT_ACCESS(B1D4,1)
// B1D4<B1D42>
extern volatile __bit                   B1D42               __at(0x71D2);	// @ (0xE3A * 8 + 2)
#define                                 B1D42_bit           _BIT_ACCESS(B1D4,2)
// B1D4<B1D43>
extern volatile __bit                   B1D43               __at(0x71D3);	// @ (0xE3A * 8 + 3)
#define                                 B1D43_bit           _BIT_ACCESS(B1D4,3)
// B1D4<B1D44>
extern volatile __bit                   B1D44               __at(0x71D4);	// @ (0xE3A * 8 + 4)
#define                                 B1D44_bit           _BIT_ACCESS(B1D4,4)
// B1D4<B1D45>
extern volatile __bit                   B1D45               __at(0x71D5);	// @ (0xE3A * 8 + 5)
#define                                 B1D45_bit           _BIT_ACCESS(B1D4,5)
// B1D4<B1D46>
extern volatile __bit                   B1D46               __at(0x71D6);	// @ (0xE3A * 8 + 6)
#define                                 B1D46_bit           _BIT_ACCESS(B1D4,6)
// B1D4<B1D47>
extern volatile __bit                   B1D47               __at(0x71D7);	// @ (0xE3A * 8 + 7)
#define                                 B1D47_bit           _BIT_ACCESS(B1D4,7)
// B1D5<B1D50>
extern volatile __bit                   B1D50               __at(0x71D8);	// @ (0xE3B * 8 + 0)
#define                                 B1D50_bit           _BIT_ACCESS(B1D5,0)
// B1D5<B1D51>
extern volatile __bit                   B1D51               __at(0x71D9);	// @ (0xE3B * 8 + 1)
#define                                 B1D51_bit           _BIT_ACCESS(B1D5,1)
// B1D5<B1D52>
extern volatile __bit                   B1D52               __at(0x71DA);	// @ (0xE3B * 8 + 2)
#define                                 B1D52_bit           _BIT_ACCESS(B1D5,2)
// B1D5<B1D53>
extern volatile __bit                   B1D53               __at(0x71DB);	// @ (0xE3B * 8 + 3)
#define                                 B1D53_bit           _BIT_ACCESS(B1D5,3)
// B1D5<B1D54>
extern volatile __bit                   B1D54               __at(0x71DC);	// @ (0xE3B * 8 + 4)
#define                                 B1D54_bit           _BIT_ACCESS(B1D5,4)
// B1D5<B1D55>
extern volatile __bit                   B1D55               __at(0x71DD);	// @ (0xE3B * 8 + 5)
#define                                 B1D55_bit           _BIT_ACCESS(B1D5,5)
// B1D5<B1D56>
extern volatile __bit                   B1D56               __at(0x71DE);	// @ (0xE3B * 8 + 6)
#define                                 B1D56_bit           _BIT_ACCESS(B1D5,6)
// B1D5<B1D57>
extern volatile __bit                   B1D57               __at(0x71DF);	// @ (0xE3B * 8 + 7)
#define                                 B1D57_bit           _BIT_ACCESS(B1D5,7)
// B1D6<B1D60>
extern volatile __bit                   B1D60               __at(0x71E0);	// @ (0xE3C * 8 + 0)
#define                                 B1D60_bit           _BIT_ACCESS(B1D6,0)
// B1D6<B1D61>
extern volatile __bit                   B1D61               __at(0x71E1);	// @ (0xE3C * 8 + 1)
#define                                 B1D61_bit           _BIT_ACCESS(B1D6,1)
// B1D6<B1D62>
extern volatile __bit                   B1D62               __at(0x71E2);	// @ (0xE3C * 8 + 2)
#define                                 B1D62_bit           _BIT_ACCESS(B1D6,2)
// B1D6<B1D63>
extern volatile __bit                   B1D63               __at(0x71E3);	// @ (0xE3C * 8 + 3)
#define                                 B1D63_bit           _BIT_ACCESS(B1D6,3)
// B1D6<B1D64>
extern volatile __bit                   B1D64               __at(0x71E4);	// @ (0xE3C * 8 + 4)
#define                                 B1D64_bit           _BIT_ACCESS(B1D6,4)
// B1D6<B1D65>
extern volatile __bit                   B1D65               __at(0x71E5);	// @ (0xE3C * 8 + 5)
#define                                 B1D65_bit           _BIT_ACCESS(B1D6,5)
// B1D6<B1D66>
extern volatile __bit                   B1D66               __at(0x71E6);	// @ (0xE3C * 8 + 6)
#define                                 B1D66_bit           _BIT_ACCESS(B1D6,6)
// B1D6<B1D67>
extern volatile __bit                   B1D67               __at(0x71E7);	// @ (0xE3C * 8 + 7)
#define                                 B1D67_bit           _BIT_ACCESS(B1D6,7)
// B1D7<B1D70>
extern volatile __bit                   B1D70               __at(0x71E8);	// @ (0xE3D * 8 + 0)
#define                                 B1D70_bit           _BIT_ACCESS(B1D7,0)
// B1D7<B1D71>
extern volatile __bit                   B1D71               __at(0x71E9);	// @ (0xE3D * 8 + 1)
#define                                 B1D71_bit           _BIT_ACCESS(B1D7,1)
// B1D7<B1D72>
extern volatile __bit                   B1D72               __at(0x71EA);	// @ (0xE3D * 8 + 2)
#define                                 B1D72_bit           _BIT_ACCESS(B1D7,2)
// B1D7<B1D73>
extern volatile __bit                   B1D73               __at(0x71EB);	// @ (0xE3D * 8 + 3)
#define                                 B1D73_bit           _BIT_ACCESS(B1D7,3)
// B1D7<B1D74>
extern volatile __bit                   B1D74               __at(0x71EC);	// @ (0xE3D * 8 + 4)
#define                                 B1D74_bit           _BIT_ACCESS(B1D7,4)
// B1D7<B1D75>
extern volatile __bit                   B1D75               __at(0x71ED);	// @ (0xE3D * 8 + 5)
#define                                 B1D75_bit           _BIT_ACCESS(B1D7,5)
// B1D7<B1D76>
extern volatile __bit                   B1D76               __at(0x71EE);	// @ (0xE3D * 8 + 6)
#define                                 B1D76_bit           _BIT_ACCESS(B1D7,6)
// B1D7<B1D77>
extern volatile __bit                   B1D77               __at(0x71EF);	// @ (0xE3D * 8 + 7)
#define                                 B1D77_bit           _BIT_ACCESS(B1D7,7)
// B1DLC<B1DLC0>
extern volatile __bit                   B1DLC0              __at(0x71A8);	// @ (0xE35 * 8 + 0)
#define                                 B1DLC0_bit          _BIT_ACCESS(B1DLC,0)
// B1DLC<B1DLC1>
extern volatile __bit                   B1DLC1              __at(0x71A9);	// @ (0xE35 * 8 + 1)
#define                                 B1DLC1_bit          _BIT_ACCESS(B1DLC,1)
// B1DLC<B1DLC2>
extern volatile __bit                   B1DLC2              __at(0x71AA);	// @ (0xE35 * 8 + 2)
#define                                 B1DLC2_bit          _BIT_ACCESS(B1DLC,2)
// B1DLC<B1DLC3>
extern volatile __bit                   B1DLC3              __at(0x71AB);	// @ (0xE35 * 8 + 3)
#define                                 B1DLC3_bit          _BIT_ACCESS(B1DLC,3)
// B1EIDL<B1EID0>
extern volatile __bit                   B1EID0              __at(0x71A0);	// @ (0xE34 * 8 + 0)
#define                                 B1EID0_bit          _BIT_ACCESS(B1EIDL,0)
// B1EIDL<B1EID1>
extern volatile __bit                   B1EID1              __at(0x71A1);	// @ (0xE34 * 8 + 1)
#define                                 B1EID1_bit          _BIT_ACCESS(B1EIDL,1)
// B1EIDH<B1EID10>
extern volatile __bit                   B1EID10             __at(0x719A);	// @ (0xE33 * 8 + 2)
#define                                 B1EID10_bit         _BIT_ACCESS(B1EIDH,2)
// B1EIDH<B1EID11>
extern volatile __bit                   B1EID11             __at(0x719B);	// @ (0xE33 * 8 + 3)
#define                                 B1EID11_bit         _BIT_ACCESS(B1EIDH,3)
// B1EIDH<B1EID12>
extern volatile __bit                   B1EID12             __at(0x719C);	// @ (0xE33 * 8 + 4)
#define                                 B1EID12_bit         _BIT_ACCESS(B1EIDH,4)
// B1EIDH<B1EID13>
extern volatile __bit                   B1EID13             __at(0x719D);	// @ (0xE33 * 8 + 5)
#define                                 B1EID13_bit         _BIT_ACCESS(B1EIDH,5)
// B1EIDH<B1EID14>
extern volatile __bit                   B1EID14             __at(0x719E);	// @ (0xE33 * 8 + 6)
#define                                 B1EID14_bit         _BIT_ACCESS(B1EIDH,6)
// B1EIDH<B1EID15>
extern volatile __bit                   B1EID15             __at(0x719F);	// @ (0xE33 * 8 + 7)
#define                                 B1EID15_bit         _BIT_ACCESS(B1EIDH,7)
// B1SIDL<B1EID16>
extern volatile __bit                   B1EID16             __at(0x7190);	// @ (0xE32 * 8 + 0)
#define                                 B1EID16_bit         _BIT_ACCESS(B1SIDL,0)
// B1SIDL<B1EID17>
extern volatile __bit                   B1EID17             __at(0x7191);	// @ (0xE32 * 8 + 1)
#define                                 B1EID17_bit         _BIT_ACCESS(B1SIDL,1)
// B1EIDL<B1EID2>
extern volatile __bit                   B1EID2              __at(0x71A2);	// @ (0xE34 * 8 + 2)
#define                                 B1EID2_bit          _BIT_ACCESS(B1EIDL,2)
// B1EIDL<B1EID3>
extern volatile __bit                   B1EID3              __at(0x71A3);	// @ (0xE34 * 8 + 3)
#define                                 B1EID3_bit          _BIT_ACCESS(B1EIDL,3)
// B1EIDL<B1EID4>
extern volatile __bit                   B1EID4              __at(0x71A4);	// @ (0xE34 * 8 + 4)
#define                                 B1EID4_bit          _BIT_ACCESS(B1EIDL,4)
// B1EIDL<B1EID5>
extern volatile __bit                   B1EID5              __at(0x71A5);	// @ (0xE34 * 8 + 5)
#define                                 B1EID5_bit          _BIT_ACCESS(B1EIDL,5)
// B1EIDL<B1EID6>
extern volatile __bit                   B1EID6              __at(0x71A6);	// @ (0xE34 * 8 + 6)
#define                                 B1EID6_bit          _BIT_ACCESS(B1EIDL,6)
// B1EIDL<B1EID7>
extern volatile __bit                   B1EID7              __at(0x71A7);	// @ (0xE34 * 8 + 7)
#define                                 B1EID7_bit          _BIT_ACCESS(B1EIDL,7)
// B1EIDH<B1EID8>
extern volatile __bit                   B1EID8              __at(0x7198);	// @ (0xE33 * 8 + 0)
#define                                 B1EID8_bit          _BIT_ACCESS(B1EIDH,0)
// B1EIDH<B1EID9>
extern volatile __bit                   B1EID9              __at(0x7199);	// @ (0xE33 * 8 + 1)
#define                                 B1EID9_bit          _BIT_ACCESS(B1EIDH,1)
// B1SIDL<B1EXID>
extern volatile __bit                   B1EXID              __at(0x7193);	// @ (0xE32 * 8 + 3)
#define                                 B1EXID_bit          _BIT_ACCESS(B1SIDL,3)
// B1CON<B1FILHIT0>
extern volatile __bit                   B1FILHIT0           __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 B1FILHIT0_bit       _BIT_ACCESS(B1CON,0)
// B1CON<B1FILHIT1>
extern volatile __bit                   B1FILHIT1           __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 B1FILHIT1_bit       _BIT_ACCESS(B1CON,1)
// B1CON<B1FILHIT2>
extern volatile __bit                   B1FILHIT2           __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 B1FILHIT2_bit       _BIT_ACCESS(B1CON,2)
// B1CON<B1FILHIT3>
extern volatile __bit                   B1FILHIT3           __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 B1FILHIT3_bit       _BIT_ACCESS(B1CON,3)
// B1CON<B1FILHIT4>
extern volatile __bit                   B1FILHIT4           __at(0x7184);	// @ (0xE30 * 8 + 4)
#define                                 B1FILHIT4_bit       _BIT_ACCESS(B1CON,4)
// BIE0<B1IE>
extern volatile __bit                   B1IE                __at(0x6FD3);	// @ (0xDFA * 8 + 3)
#define                                 B1IE_bit            _BIT_ACCESS(BIE0,3)
// B1DLC<B1RB0>
extern volatile __bit                   B1RB0               __at(0x71AC);	// @ (0xE35 * 8 + 4)
#define                                 B1RB0_bit           _BIT_ACCESS(B1DLC,4)
// B1DLC<B1RB1>
extern volatile __bit                   B1RB1               __at(0x71AD);	// @ (0xE35 * 8 + 5)
#define                                 B1RB1_bit           _BIT_ACCESS(B1DLC,5)
// B1CON<B1RTREN>
extern volatile __bit                   B1RTREN             __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 B1RTREN_bit         _BIT_ACCESS(B1CON,2)
// B1CON<B1RTRRO>
extern volatile __bit                   B1RTRRO             __at(0x7185);	// @ (0xE30 * 8 + 5)
#define                                 B1RTRRO_bit         _BIT_ACCESS(B1CON,5)
// B1CON<B1RXFUL>
extern volatile __bit                   B1RXFUL             __at(0x7187);	// @ (0xE30 * 8 + 7)
#define                                 B1RXFUL_bit         _BIT_ACCESS(B1CON,7)
// B1CON<B1RXM1>
extern volatile __bit                   B1RXM1              __at(0x7186);	// @ (0xE30 * 8 + 6)
#define                                 B1RXM1_bit          _BIT_ACCESS(B1CON,6)
// B1DLC<B1RXRTR>
extern volatile __bit                   B1RXRTR             __at(0x71AE);	// @ (0xE35 * 8 + 6)
